; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=22, remove_proportion=0.2, bases=4, instance_id=10, output=./training, seed=51

(define (problem warehouse-10)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 - box
        base1 base2 base3 base4 - base
    )
    (:init
        (to-remove box6)
        (to-remove box8)
        (to-remove box17)
        (to-remove box18)
        (clear box13)
        (on box13 box15)
        (on box15 box12)
        (on box12 box11)
        (on-base box11 base1)
        (clear box2)
        (on box2 box17)
        (on box17 box1)
        (on box1 box22)
        (on-base box22 base2)
        (clear box7)
        (on box7 box20)
        (on box20 box9)
        (on box9 box3)
        (on box3 box14)
        (on box14 box18)
        (on box18 box19)
        (on box19 box6)
        (on-base box6 base3)
        (clear box8)
        (on box8 box5)
        (on box5 box21)
        (on box21 box16)
        (on box16 box10)
        (on box10 box4)
        (on-base box4 base4)
    )
    (:goal (and 
        (removed box6)
        (removed box8)
        (removed box17)
        (removed box18)
    ))
)

; plan
1. (move box2 box17 box13)
   deleted: (clear box13) (on box2 box17)
   added: (on box2 box13) (clear box17)
   goals met: 0 of 4
2. (remove box17 box1)
   deleted: (on box17 box1) (clear box17)
   added: (removed box17) (clear box1)
   goals met: 1 of 4
3. (move box7 box20 box1)
   deleted: (clear box1) (on box7 box20)
   added: (on box7 box1) (clear box20)
   goals met: 1 of 4
4. (move box20 box9 box2)
   deleted: (clear box2) (on box20 box9)
   added: (on box20 box2) (clear box9)
   goals met: 1 of 4
5. (move box9 box3 box20)
   deleted: (clear box20) (on box9 box3)
   added: (on box9 box20) (clear box3)
   goals met: 1 of 4
6. (move box3 box14 box7)
   deleted: (clear box7) (on box3 box14)
   added: (on box3 box7) (clear box14)
   goals met: 1 of 4
7. (move box14 box18 box3)
   deleted: (clear box3) (on box14 box18)
   added: (on box14 box3) (clear box18)
   goals met: 1 of 4
8. (remove box18 box19)
   deleted: (on box18 box19) (clear box18)
   added: (removed box18) (clear box19)
   goals met: 2 of 4
9. (move box19 box6 box14)
   deleted: (clear box14) (on box19 box6)
   added: (on box19 box14) (clear box6)
   goals met: 2 of 4
10. (remove-from-base box6 base3)
   deleted: (on-base box6 base3) (clear box6)
   added: (removed box6) (clear-base base3)
   goals met: 3 of 4
11. (remove box8 box5)
   deleted: (on box8 box5) (clear box8)
   added: (removed box8) (clear box5)
   goals met: 4 of 4
